[
 
  {
    "designation": "Trainee Analyst – Financial Data & Operations",
    "sections": [
      {
        "heading": "Oversight",
        "content": "A London based asset Management Company established its office in Islamabad in 2021. The office has seen rapid growth over the last 12 months and continues to grow in 2025. The company also provides middle and back-office services to our other office in Monaco and Switzerland. London is the operational hub of the entire group. In 2021, the group set up FGK Back Office Services in Islamabad as an offshore centre that supports the London operations. Due to the success of this office, we are now looking to offer the training program to fresh graduates. FGK Back Office Services (Private) Limited is engaged in Back Office Services and is registered with Securities and Exchange Commission of Pakistan. FGK Back Office Services (Private) Limited started its operations in November 2021 with a strategic decision and ambition to provide Back Office Services to Financial and Banking Sector Companies working domestically and overseas. Our Back Office Services includes but not limited to: DATA MANAGEMENT, OPERATIONS SUPPORT, ACCOUNTING & REPORTING, PORTFOLIO MANAGEMENT. We are an IT Enabled Services Company as defined by Pakistan Software Export Board (PSEB). As an IT Enabled Services Company, we are among the few Companies that Export IT Services worldwide, contribute our share in economic growth, and utilizes the true potential of talented individuals."
      },
      {
        "heading": "Program Overview",
        "content": "As a Trainee Analyst, you will receive structured training and hands-on experience in the core functions of our operations and data teams. The program is ideal for candidates looking to pursue careers in asset management, data analytics, and financial operations."
      },
      {
        "heading": "Key Responsibilities (Training & Exposure)",
        "list": [
          "Assist in transaction processing and maintaining financial records.",
          "Perform data entry and analysis tasks related to portfolio and account updates.",
          "Support account and cash reconciliations under supervision.",
          "Help in generating and formatting daily, weekly, and monthly performance reports.",
          "Learn to maintain accurate data in portfolio management systems.",
          "Assist in updating security prices, account openings, and KYC tracking.",
          "Support documentation, recordkeeping, and meeting minutes preparation.",
          "Collaborate with team members on data queries and operational tasks."
        ]
      },
      {
        "heading": "Learning Outcomes",
        "list": [
          "Understand the end-to-end workflow of asset management operations.",
          "Be proficient in Microsoft Excel and other financial data tools.",
          "Gain working knowledge of Bloomberg, data systems, and reconciliations.",
          "Learn to handle performance reporting, compliance tracking, and account operations."
        ]
      },
      {
        "heading": "Eligibility Criteria",
        "list": [
          "Recent graduates or final-year students pursuing degrees in Finance, Banking, Accounting, Economics, or Management.",
          "Strong academic record and keen interest in financial markets and data handling.",
          "Proficient in MS Excel and Office Suite (basic to intermediate level).",
          "Strong written and verbal communication skills in English.",
          "Willingness to learn and contribute as a team player in a dynamic environment."
        ]
      },
      {
        "heading": "What We Offer",
        "list": [
          "Stipend-based internship.",
          "Training by industry professionals.",
          "Exposure to global financial operations.",
          "Certificate of completion.",
          "Potential full-time employment opportunity based on performance."
        ]
      },
      {
        "heading": "How to Apply",
        "content": "If you believe your background meets the criteria, please visit www.fgkbackoffice.com/careers and submit your CV with a cover letter."
      }
    ]
  }
]
