[
  {
    "id": "operations-support",
    "title": "Operational Excellence, Seamlessly Delivered",
    "paragraph": "At FGK Back Office Services, we provide comprehensive operations support that empowers your business to run smoother, faster, and more efficiently. From investment operations to compliance reporting, our expert-driven solutions help reduce complexity, manage risk, and enhance performance—so you can stay focused on growth.",
    "mobileImage": "/op_sup.jpg",
    "desktopImage": "/Operations_Support_1920px_hero_section.png"
  },
  {
    "id": "data-management",
    "title": "Unlock the Power of Your Data",
    "paragraph": "At FGK Back Office Services, our data management solutions help you transform raw information into strategic intelligence. From analytics to reconciliation, we ensure your data is clean, secure, and actionable—driving smarter decisions across your organisation.",
    "mobileImage": "/data_mang.jpg",
    "desktopImage": "/Data_Management_1920px_hero_section.png"
  },
  {
    "id": "project-management",
    "title": "Strategic Project Management That Delivers Results",
    "paragraph": "At FGK Back Office Services, we offer end-to-end project management solutions tailored to your business goals. From planning to execution, our expert team ensures your projects are delivered on time, within budget, and to the highest standards. Whether you're launching a new initiative, managing complex operations, or scaling existing workflows, we provide the tools, structure, and strategic oversight needed to succeed.",
    "mobileImage": "/proj-mang.jpg",
    "desktopImage": "/Project_Management_Support_1920px_hero_section.png"
  },
  {
    "id": "accounting-and-reporting",
    "title": "Clarity Through Expert Accounting",
    "paragraph": "At FGK Back Office Services, we deliver precise, compliant, and insight-driven accounting solutions tailored to your business. From bookkeeping and financial reporting to performance analysis and forecasting, we help you understand your numbers—so you can focus on growth with confidence.",
    "mobileImage": "/Accounting_and_Reporting.jpg",
    "desktopImage": "/Accounting_&_Reporting_1920px_hero_section.png"
  },
  {
    "id": "web-development",
    "title": "Custom Web Solutions That Perform",
    "paragraph": "At FGK Back Office Services, we craft high-end, fully tailored web applications that combine modern design with powerful functionality. Whether it's a corporate site, internal dashboard, or scalable web app, our solutions are built to reflect your vision, enhance user experience, and support your business goals with cutting-edge technology.",
    "mobileImage": "/web_dev.jpg",
    "desktopImage": "/Web_Development_Support_1920px_hero_section.png"
  },
  {
    "id": "human-resources",
    "title": "Human Resources",
    "paragraph": "Simplify HR management with our tailored solutions.",
    "mobileImage": "/human_res.jpg",
    "desktopImage": "/Human_Resources_1920px_hero_section.png"
  }
]
